Ran Plan for project: `iam/gyanni` dir: `terraform-provisioning/terraform/iam/gyanni` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.sops_gyanni.aws_iam_role.common will be created
+ resource "aws_iam_role" "common" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                              + "arn:aws:iam::289574460446:role/atlantis-ecs_task_execution",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gyanni-sops"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.sops_gyanni.aws_iam_role.secure will be created
+ resource "aws_iam_role" "secure" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                              + "arn:aws:iam::289574460446:role/atlantis-ecs_task_execution",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gyanni-secure-sops"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.sops_gyanni.aws_iam_role_policy.common-passrole will be created
+ resource "aws_iam_role_policy" "common-passrole" {
      + id          = (known after apply)
      + name        = "gyanni-sops-passrole"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowIAMPassRole"
                    },
                ]
            }
        )
      + role        = (known after apply)
    }

  # module.sops_gyanni.aws_iam_role_policy.secure-passrole will be created
+ resource "aws_iam_role_policy" "secure-passrole" {
      + id          = (known after apply)
      + name        = "gyanni-secure-sops-passrole"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowIAMPassRole"
                    },
                ]
            }
        )
      + role        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ sops_gyanni_common_role_arn = (known after apply)
+ sops_gyanni_secure_role_arn = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/gyanni`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-402650273.ap-northeast-2.elb.amazonaws.com/lock?id=Gyanni%252Fterraform-playground%252Fterraform-provisioning%252Fterraform%252Fiam%252Fgyanni%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/gyanni`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
